{
  "PART I": {
    "title": "THE UNION AND ITS TERRITORY",
    "explanation": "Defines the name of India and describes the states, union territories, and their territorial boundaries."
  },
  "PART II": {
    "title": "CITIZENSHIP",
    "explanation": "Explains who is an Indian citizen and how citizenship is acquired or terminated."
  },
  "PART III": {
    "title": "FUNDAMENTAL RIGHTS",
    "explanation": "Guarantees basic rights such as equality, freedom, religion, and constitutional remedies to citizens."
  },
  "PART IV": {
    "title": "DIRECTIVE PRINCIPLES OF STATE POLICY",
    "explanation": "Provides guidelines for the State to establish social and economic democracy."
  },
  "PART V": {
    "title": "THE UNION",
    "explanation": "Describes the structure, powers, and functions of the Union government."
  },
  "PART VI": {
    "title": "THE STATES",
    "explanation": "Explains the organization, powers, and functioning of State governments."
  },
  "PART VII": {
    "title": "- [Omitted]",
    "explanation": "This Part was removed by a constitutional amendment and is no longer in force."
  },
  "PART VIII": {
    "title": "THE UNION TERRITORIES",
    "explanation": "Deals with the administration and governance of Union Territories."
  },
  "PART IX": {
    "title": "THE PANCHAYATS",
    "explanation": "Introduces the Panchayati Raj system for rural local self-government."
  },
  "PART X": {
    "title": "THE SCHEDULED AND TRIBAL AREAS",
    "explanation": "Provides special administrative provisions for scheduled and tribal areas."
  },
  "PART XI": {
    "title": "RELATIONS BETWEEN THE UNION AND THE STATES",
    "explanation": "Defines legislative, administrative, and financial relations between the Union and States."
  },
  "PART XII": {
    "title": "FINANCE, PROPERTY, CONTRACTS AND SUITS",
    "explanation": "Deals with financial matters, property ownership, contracts, and legal proceedings involving governments."
  },
  "PART XIII": {
    "title": "TRADE, COMMERCE AND INTERCOURSE WITHIN THE",
    "explanation": "Ensures freedom of trade and commerce throughout the territory of India."
  },
  "PART XIV": {
    "title": "SERVICES UNDER THE UNION AND THE STATES",
    "explanation": "Regulates recruitment and service conditions of public servants."
  },
  "PART XV": {
    "title": "ELECTIONS",
    "explanation": "Provides for the conduct and supervision of elections in India."
  },
  "PART XVI": {
    "title": "SPECIAL PROVISIONS RELATING TO CERTAIN CLASSES",
    "explanation": "Provides safeguards for Scheduled Castes, Scheduled Tribes, and other backward classes."
  },
  "PART XVII": {
    "title": "OFFICIAL LANGUAGE",
    "explanation": "Specifies the official languages of the Union and States."
  },
  "PART XVIII": {
    "title": "EMERGENCY PROVISIONS",
    "explanation": "Defines conditions and effects of national, state, and financial emergencies."
  },
  "PART XIX": {
    "title": "MISCELLANEOUS",
    "explanation": "Contains miscellaneous provisions not covered elsewhere in the Constitution."
  },
  "PART XX": {
    "title": "AMENDMENT OF THE CONSTITUTION",
    "explanation": "Explains the procedure for amending the Constitution of India."
  },
  "PART XXI": {
    "title": "TEMPORARY, TRANSITIONAL AND SPECIAL PROVISIONS",
    "explanation": "Contains special provisions for certain states and regions."
  },
  "PART XXII": {
    "title": "SHORT TITLE, COMMENCEMENT, AUTHORITATIVE TEXT",
    "explanation": "Provides the name, commencement date, and authoritative text of the Constitution."
  },
  "PART IV-A": {
    "title": "FUNDAMENTAL DUTIES",
    "explanation": "Lists the moral duties of citizens towards the nation."
  },
  "PART IX-A": {
    "title": "THE MUNICIPALITIES",
    "explanation": "Establishes urban local self-government through municipalities."
  },
  "PART IX-B": {
    "title": "THE CO-OPERATIVE SOCIETIES",
    "explanation": "Provides constitutional status and regulation of cooperative societies."
  }
}
